a = input('Введите последовательность из 0 и 1: ')
b = 0
c = 0
d = 0
e = 0
f = 0
if len(a) < 5:
    print('Минимальная длина последовательности должна быть равна 5')
else:
    for i in range(len(a)):
        if a[b] == '1':
            if c > e:
                e = c
            c = 0
        elif a[b] == '0':
            d = d + 1
            c = c + 1
        elif not a[b] == '0' and not a[b] == 1:
            print('Обнаружен посторонний символ')
            f = 1
        b = b + 1
    if a[len(a) - 1] == '0':
        if c > e:
            e = c 
    if not f == 1:
        print('Общее количество пакетов: ', len(a))
        print('Количество потерянных пакетов: ', d)
        print('Длина самой длинной последовательности потерянных пакетов: ', e)
        print(f'Процент потерь: {d / len(a) * 100:.1f}')
        if d / len(a) <= 0.01:
            print('Качество связи: отличное')
        elif d / len(a) <= 0.05:
            print('Качество связи: хорошее')
        elif d / len(a) <= 0.1:
            print('Качество связи: удовлетворительное')
        elif d / len(a) <= 0.2:
            print('Качество связи: плохое')
        elif d / len(a) > 0.2:
            print('Качество связи: критическое состояние сети')    